1 Servo On
2 Mov pokiba, 50
3 Hlt
4 GoTo *STRL
5 Ovrd 10
6 Mov pkiritsu Rem 起立
7 Dly 3 'wait 3 seconds
8 Mov pojigi Rem お辞儀
9 Dly 1 ' wait 1 sec
10 Mov pkiritsu Rem 起立
11 '
12 *STRL
13 Ovrd 100
14 Rem 取るオブジェクトの近くまでの位置
15 Dim pnearobject(4)
16 pnearobject(1) = pmonoa1
17 pnearobject(2) = pmonoa2
18 pnearobject(3) = pmonoa3
19 pnearobject(4) = pmonoa4
20 '
21 Rem 実際に取るものの位置
22 Dim pobject(4)
23 pobject(1) = pmonob1
24 pobject(2) = pmonob2
25 pobject(3) = pmonob3
26 pobject(4) = pmonob4
27 Rem ホームからスタート
28 Mov phome
29 D1= 1
30 While (D1 < 5)
31     Mov pobject(D1), -120
32     Mvs pobject(D1)
33     Dly 0.5
34     HClose 1
35     Cnt 1
36     Mov pobject(D1), -120
37     'Mov pokiba, -30
38     If D1 = 4 Then
39         Mvs pokiba2, -90
40         Mov pokiba2
41     EndIf
42     If D1 = 2 Then
43         Mvs pokiba2, -90
44         Mov pokiba2
45     Else
46         Mvs pokiba1, -90
47         Mov pokiba1
48     EndIf
49     Cnt 0
50     Dly 0.2
51     HOpen 1
52     'Mvr2 pokiba, phome, pmono
53     D1 = D1+1
54 WEnd
55 Mov phome
56 Hlt
57 End
pokiba=(+602.50,+355.53,+206.74,+179.99,-1.20,-147.07)(7,0)
pkiritsu=(+21.57,+0.00,+1288.40,-0.14,+5.10,-1.55)(7,0)
pojigi=(+594.83,+0.00,+878.61,-5.04,+72.98,-5.26)(7,0)
pnearobject(1)=(+443.75,-376.40,+129.60,+179.27,-1.09,+173.59)(7,0)
pnearobject(2)=(+584.00,-393.38,+109.37,+179.95,-0.07,+179.93)(7,0)
pnearobject(3)=(+412.25,-477.21,+129.09,+179.31,-0.70,-3.45)(7,0)
pnearobject(4)=(+608.61,-509.15,+101.42,+179.01,-1.47,+173.99)(7,0)
pmonoa1=(+443.75,-376.40,+129.60,+179.27,-1.09,+173.59)(7,0)
pmonoa2=(+584.00,-393.38,+109.37,+179.95,-0.07,+179.93)(7,0)
pmonoa3=(+412.25,-477.21,+129.09,-179.26,+0.65,-179.19)(7,0)
pmonoa4=(+608.61,-509.15,+101.42,+179.01,-1.47,+173.99)(7,0)
pobject(1)=(+446.91,-372.30,+60.13,+178.60,-2.10,+174.13)(7,0)
pobject(2)=(+602.15,-383.61,+59.04,+178.61,-2.07,-178.58)(7,0)
pobject(3)=(+426.56,-493.78,+62.34,-178.24,+1.70,-3.43)(7,0)
pobject(4)=(+610.67,-510.87,+64.18,+179.05,-2.82,+158.64)(7,0)
pmonob1=(+446.91,-372.30,+60.13,+178.60,-2.10,+174.13)(7,0)
pmonob2=(+602.15,-383.61,+59.04,+178.61,-2.07,-178.58)(7,0)
pmonob3=(+426.56,-493.77,+62.34,+178.17,-1.62,+179.14)(7,0)
pmonob4=(+610.67,-510.87,+64.18,+179.05,-2.82,+158.64)(7,0)
phome=(+609.16,+0.00,+257.41,+180.00,-3.20,+180.00)(7,0)
pokiba2=(+493.46,+291.18,+160.94,-179.98,-0.29,-147.06)(7,0)
pokiba1=(+615.28,+363.08,+160.47,-179.99,-0.58,-147.07)(7,0)
pmono=(+602.50,-410.19,+137.05,+180.00,-0.02,+146.23)(7,0)
